# MYSQL Handling using Python

## connection

In [56]:
import mysql.connector as mc

mysql=mc.connect(
    host='localhost',
    user='root',
    port='22799',
    password="password",
  #  database='empdb',
    auth_plugin='mysql_native_password'
    )
print(mysql)

<mysql.connector.connection.MySQLConnection object at 0x000001575DC57C18>

## creating cursor object

In [57]:
mycur=mysql.cursor()

## Fetch all databases

In [58]:
mycur.execute("Show databases")

print(* mycur)

('emp',) ('empdb',) ('information_schema',) ('mysql',) ('performance_schema',) ('sys',)

## select or connect the particular database

In [59]:
mycur.execute("use empdb")

## Fetch all tables from the pre-connected database

In [60]:
mycur.execute("show tables")
print(*mycur)

('student',)

## Create table

In [61]:
mycur.execute("create table if not exists student (roll int not null auto_increment primary key,name varchar (100) not null,address varchar(200) not null)")

## Describe a particular table format

In [62]:
try:
    mycur.execute("describe student")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

('roll', b'int', 'NO', bytearray(b'PRI'), None, 'auto_increment')
('name', b'varchar(100)', 'NO', bytearray(b''), None, '')
('address', b'varchar(200)', 'NO', bytearray(b''), None, '')
('age', b'int', 'NO', bytearray(b''), None, '')
('father_name', b'varchar(200)', 'NO', bytearray(b''), None, '')

## Alter Table

here we can 

#### alter table TABLE_NAME add COL_NAME COL DEF    #####(ADD COL)

#### alter table TABLE_NAME drop column COL_NAME    #####(DROP COL)

#### alter table TABLE_NAME rename to NEW_TAB_NAME   #####(CHANGE TABLE NAME)

#### alter table TABLE_NAME modify COL_NAME NEW_COL_DEFINATION     #####(MODIFY COL DEFINATION)

#### alter table TABLE_NAME change column OLD_COL_NAME NEW_COL_NAME NEW_COL_DEFINATION      #####(CHANGE COL NAME)

In [63]:
try:
    mycur.execute("alter table student add father_name varchar(200) not null")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

problem to handle !!

In [64]:
try:
    mycur.execute("describe student")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

('roll', b'int', 'NO', bytearray(b'PRI'), None, 'auto_increment')
('name', b'varchar(100)', 'NO', bytearray(b''), None, '')
('address', b'varchar(200)', 'NO', bytearray(b''), None, '')
('age', b'int', 'NO', bytearray(b''), None, '')
('father_name', b'varchar(200)', 'NO', bytearray(b''), None, '')

## Enter data into a table

In [67]:
try:
    mycur.execute("insert into student values(1,'Tony Stark','64, miami road, NY',58,'Haward Stark')")
    
except:
    print("Error occured !!")

In [71]:
try:
    mycur.execute("insert into student values(2,'Thor Odinson','Asgurd',130,'Odin')")
    
except:
    print("Error occured !!")

## show the data of the table

In [73]:
try:
    mycur.execute("select * from  student")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

(1, 'Tony Stark', '64, miami road, NY', 58, 'Haward Stark')
(2, 'Thor Odinson', 'Asgurd', 130, 'Odin')

## MySQL UPDATE Query
MySQL UPDATE query is a DML statement used to modify the data of the MySQL table within the database. In a real-life scenario, records are changed over a period of time. 
So, we need to make changes in the values of the tables also. To do so, it is required to use the UPDATE query.

The UPDATE statement is used with the SET and WHERE clauses. 
The SET clause is used to change the values of the specified column. 
We can update single or multiple columns at a time.

In [76]:
try:
    mycur.execute("update student set age = 200,father_name='oodin' where address= 'asgurd'")
#     for x in mycur:
#         print(x)
except:
    print("problem to handle !! ")

In [77]:
try:
    mycur.execute("select * from  student")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

(1, 'Tony Stark', '64, miami road, NY', 58, 'Haward Stark')
(2, 'Thor Odinson', 'Asgurd', 200, 'oodin')

In [78]:
try:
    mycur.execute("insert into student values(3,'vision','lab',5,'Jarvis')")
    
except:
    print("Error occured !!")

In [79]:
try:
    mycur.execute("select * from  student")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

(1, 'Tony Stark', '64, miami road, NY', 58, 'Haward Stark')
(2, 'Thor Odinson', 'Asgurd', 200, 'oodin')
(3, 'vision', 'lab', 5, 'Jarvis')

In [83]:
try:
    mycur.execute("delete from student where name='vision'")
#     for x in mycur:
#         print(x)
except:
    print("problem to handle !! ")

In [84]:
try:
    mycur.execute("select * from  student")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

(1, 'Tony Stark', '64, miami road, NY', 58, 'Haward Stark')
(2, 'Thor Odinson', 'Asgurd', 200, 'oodin')

## MySQL Distinct Clause
MySQL DISTINCT clause is used to remove duplicate records from the table and fetch only the unique records. 
The DISTINCT clause is only used with the SELECT statement.

In [85]:
try:
    mycur.execute("select distinct name, father_name from  student")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

('Tony Stark', 'Haward Stark')
('Thor Odinson', 'oodin')

## MySQL WHERE Clause
MySQL WHERE Clause is used with SELECT, INSERT, UPDATE and DELETE clause to filter the results. 
It specifies a specific position where you have to do the operation

In [87]:
try:
    mycur.execute("select distinct name, father_name from  student where age=58 or address='asgurd'")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

('Tony Stark', 'Haward Stark')
('Thor Odinson', 'oodin')

In [88]:
try:
    mycur.execute("select distinct name, father_name from  student where age=200 and address='asgurd'")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

('Thor Odinson', 'oodin')

## MySQL ORDER BY Clause
The MYSQL ORDER BY Clause is used to sort the records in ascending or descending order.

In [89]:
try:
    mycur.execute("select distinct name, father_name from  student order by age DESC")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

('Thor Odinson', 'oodin')
('Tony Stark', 'Haward Stark')

In [90]:
try:
    mycur.execute("insert into student values(3,'loki','asgurd',150,'odin')")
    
except:
    print("Error occured !!")

In [96]:
try:
    mycur.execute("select  address , count(*)  from student group by address")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

('64, miami road, NY', 1)
('Asgurd', 2)

## MySQL HAVING Clause
MySQL HAVING Clause is used with GROUP BY clause. It always returns the rows where condition is TRUE.

In [100]:
try:
    mycur.execute("select  address , count(*)  from student group by address having count(*)>=2")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

('Asgurd', 2)

In [102]:
try:
    mycur.execute("select  address , count(*)  from student group by address having count(*)<2")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

('64, miami road, NY', 1)

## MySQL LIKE condition
In MySQL, LIKE condition is used to perform pattern matching to find the correct result.
It is used in SELECT, INSERT, UPDATE and DELETE statement with the combination of 
WHERE clause.

In [103]:
try:
    mycur.execute("select * from student where name like 'Tho%'")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

(2, 'Thor Odinson', 'Asgurd', 200, 'oodin')

In [104]:
try:
    mycur.execute("select * from student where name like 'T%'")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

(1, 'Tony Stark', '64, miami road, NY', 58, 'Haward Stark')
(2, 'Thor Odinson', 'Asgurd', 200, 'oodin')

In [108]:
try:
    mycur.execute("select * from student where name like 'T_ny %'")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

(1, 'Tony Stark', '64, miami road, NY', 58, 'Haward Stark')

In [109]:
try:
    mycur.execute("select * from student where name not like 'T_ny %'")
    for x in mycur:
        print(x)
except:
    print("problem to handle !! ")

(2, 'Thor Odinson', 'Asgurd', 200, 'oodin')
(3, 'loki', 'asgurd', 150, 'odin')